print('\nЗадача task.1-Тестовое задание. .\n')

# РЕШЕНИЕ
# Степан устраивается на работу и должен выполнить тестовое задание:
# проанализировать таблицу, понять, как она строится, и написать программу для её вывода на экран.
# =============================



# region {===== Основной код =====}

start = 0
stop = 10 + 1

while start != 5 + 1:

	for num in range(start, stop + 1, 2,):
		print(num, end="\t")

	print()

	start += 1
	stop += 1

# endregion {===== Основной код =====}