print('\nЗадача Детали. .\n')

# РЕШЕНИЕ
# Напишите программу, которая запрашивает у пользователя деталь, их количество и общую стоимость
# =============================





# region {===== Основной код =====}

shop = [['каретка', 1200], ['шатун', 1000], ['педаль', 100], ['седло', 1500], ['рама', 12000], ['обод', 2000]]
name = input("Введите название: ")
count = int(input("Количество деталей "))

counter = 0
pay = 0

for _ in range(len(shop) - 1):

	if shop[counter][0] == name:
		pay = shop[counter][1]

	counter += 1
print('Общая стоймость:', pay * count)

# endregion {===== Основной код =====}