print('\nЗадача 7. Своя функция.\n')

# РЕШЕНИЕ
# Даны строка и кортеж из чисел. Напишите программу, которая создаёт генератор из пар кортежей «символ — число».
# Затем выведите на экран сам генератор и кортежи.

# Пример:
#
# Строка: abcd
#
# Кортеж чисел: (10, 20, 30, 40)
#
# Результат:
#
# <generator object <genexpr> at 0x00000204A4234048>
#
# ('a', 10)
#
# ('b', 20)
#
# ('c', 30)
#
# ('d', 40)
# =============================





# region {===== Основной код =====}

string = list(input('Строка: '))
number_lst = input('введите кортеж чисел через запятую').split(', ')
full_list = [(string[counter], number_lst[counter]) for counter in range(0, len(string))]
for letter in full_list:
	print(letter)

# endregion {===== Основной код =====}