print('\nЗадача task.2-Лестница. .\n')

# РЕШЕНИЕ
# Пользователь вводит число N.
# Напишите программу, которая выводит такую “лесенку” из чисел:

# Введите число: 5
# 1
# 2 2
# 3 3 3
# 4 4 4 4
# 5 5 5 5 5
# =============================



# region {===== Основной код =====}


array = int(input("Введите число"))

for row in range(1, array + 1):

	for col in range(1, row + 1):
		print(row, end =" ")

	print() # column - столбец row - строка

# endregion {===== Основной код =====}